# # 입력된 정수 숫자 뒤짚기
# a = int(input())
 
# # 12 입력시 21 출력
# b = (a // 10) + (a % 10) * 10
# print(b)
 
# # 123 입력시 321 출력
# b = (a // 100) + (((a % 100) // 10) * 10) + ((a % 10) * 100)
# print(b)
 
# # 1234 입력시 4321 출력 -------------------------더있음--------------------------------------
# b = (a // 1000) + (((a % 1000) // 100) * 10) + (((a % 100) // 10) * 100) + ((a % 10) * 1000)
# print(b)
# .
# .
# .
 
# # 숫자가 늘수록 노가다 
 
# # 더 쉬운 방법
# a = int(input())
 
# # 123 = 321 / 1234 = 4321 / 12345 = 54321
# print(int(str(a)[::-1]))

a,b = map(int,input().split())
a = int(str(a)[::-1])
b = int(str(b)[::-1])
print(a if a>b else b)